## 11.2 从SQL数据库中读取DataFrame，从DataFrame导出到SQL数据库

#### 1. 连接数据库
SQL与Pandas通信依赖于：1. SQLAlchemy库 2. 数据库驱动程序（如SQLite的sqlite3，MySQL的pymysql等）

##### 1.1 引入必要依赖

In [1]:
# conda install sqlalchemy pymysql

In [2]:
import pandas as pd
# 引入SQLAlchemy的create_engine函数，用于创建数据库连接引擎
from sqlalchemy import create_engine

##### 1.2 创建数据库连接引擎（以MySQL为例）
mysql+pymysql://user:password@localhost:3306/test_db

In [3]:
engine = create_engine(
    "mysql+pymysql://dev:dev123@localhost:3306/sql_hr"
)

#### 2. 从SQL数据库中读取DataFrame

##### 2.1 全表读取

In [6]:
df_emp = pd.read_sql_table("employees", con=engine)
df_emp

,employee_id,first_name,last_name,job_title,salary,reports_to,office_id
0,33391,D'arcy,Nortunen,Account Executive,62871,37270.0,1
1,37270,Yovonnda,Magrannell,Executive Secretary,63996,NaN,10
2,37851,Sayer,Matterson,Statistician III,98926,37270.0,1
3,40448,Mindy,Crissil,Staff Scientist,94860,37270.0,1
4,56274,Keriann,Alloisi,VP Marketing,110150,37270.0,1
5,63196,Alaster,Scutchin,Assistant Professor,32179,37270.0,2
6,67009,North,de Clerc,VP Product Management,114257,37270.0,2
7,67370,Elladine,Rising,Social Worker,96767,37270.0,2
8,68249,Nisse,Voysey,Financial Advisor,52832,37270.0,2
9,72540,Guthrey,Iacopetti,Office Assistant I,117690,37270.0,3
10,72913,Kass,Hefferan,Computer Systems Analyst IV,96401,37270.0,3
11,75900,Virge,Goodrum,Information Systems Manager,54578,37270.0,3
12,76196,Mirilla,Janowski,Cost Accountant,119241,37270.0,3
13,80529,Lynde,Aronson,Junior Executive,77182,37270.0,4
14,80679,Mildrid,Sokale,Geologist II,67987,37270.0,4
15,84791,Hazel,Tarbert,General Manager,93760,37270.0,4
16,95213,Cole,Kesterton,Pharmacist,86119,37270.0,4
17,96513,Theresa,Binney,Food Chemist,47354,37270.0,5
18,98374,Estrellita,Daleman,Staff Accountant IV,70187,37270.0,5
19,115357,Ivy,Fearey,Structural Engineer,92710,37270.0,5

##### 2.2 执行指定的SQL查询语句

In [9]:
df_emp_sub = pd.read_sql_query(
    """
    SELECT * FROM employees
    WHERE office_id = 3;
    """,
    con=engine
)
df_emp_sub

,employee_id,first_name,last_name,job_title,salary,reports_to,office_id
0,72540,Guthrey,Iacopetti,Office Assistant I,117690,37270,3
1,72913,Kass,Hefferan,Computer Systems Analyst IV,96401,37270,3
2,75900,Virge,Goodrum,Information Systems Manager,54578,37270,3
3,76196,Mirilla,Janowski,Cost Accountant,119241,37270,3

##### 2.3 .read_sql() 方法：可传递表名称或者SQL查询语句，自动判断是查询语句还是直接是表名称

#### 3. 将DataFrame导出到SQL数据库

##### 3.1 将DataFrame导出到SQL数据库中的新表
参数说明：
- name：新表名称
- con：数据库连接引擎
- if_exists：如果表已存在，采取的操作。'fail'（默认值）表示报错，'replace'表示删除原表并创建新表，'append'表示在原表后追加数据
- index：是否导出索引列，默认为True，建议修改为False，避免导出索引列

In [8]:
df_emp.to_sql(
    name="employees_pandas_exported",
    con=engine,
    if_exists="replace",
    index=False
)

20